vmux0.0.13-pre/ycsbVMs_ycsb_32vms_vmux-med_-1rps_rep0/vm9.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6387 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6387 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-04-02 00:24:05:437 0 sec: 0 operations; est completion in 0 second 
2025-04-02 00:24:15:264 10 sec: 54942 operations; 5494.2 current ops/sec; est completion in 21 hours 42 minutes [READ: Count=27411, Max=53311, Min=77, Avg=174.33, 90=212, 99=641, 99.9=3941, 99.99=9807] [UPDATE: Count=27534, Max=12823, Min=74, Avg=173.56, 90=213, 99=763, 99.9=3893, 99.99=7795] 
2025-04-02 00:24:25:264 20 sec: 114797 operations; 5985.5 current ops/sec; est completion in 20 hours 46 minutes [READ: Count=29962, Max=5155, Min=79, Avg=165.58, 90=225, 99=451, 99.9=3005, 99.99=4423] [UPDATE: Count=29890, Max=20703, Min=75, Avg=163.33, 90=223, 99=426, 99.9=2741, 99.99=3987] 
2025-04-02 00:24:35:264 30 sec: 176302 operations; 6150.5 current ops/sec; est completion in 20 hours 17 minutes [READ: Count=30814, Max=4431, Min=74, Avg=161.92, 90=225, 99=459, 99.9=1536, 99.99=3719] [UPDATE: Count=30691, Max=12063, Min=75, Avg=159.17, 90=222, 99=424, 99.9=1124, 99.99=6955] 
2025-04-02 00:24:45:264 40 sec: 240372 operations; 6407 current ops/sec; est completion in 19 hours 50 minutes [READ: Count=32091, Max=10039, Min=77, Avg=155.3, 90=210, 99=362, 99.9=927, 99.99=3507] [UPDATE: Count=31979, Max=3871, Min=77, Avg=153, 90=209, 99=345, 99.9=954, 99.99=3439] 
2025-04-02 00:24:55:264 50 sec: 305661 operations; 6528.9 current ops/sec; est completion in 19 hours 30 minutes [READ: Count=32603, Max=5683, Min=73, Avg=152.21, 90=210, 99=337, 99.9=655, 99.99=3337] [UPDATE: Count=32686, Max=4099, Min=76, Avg=150.4, 90=208, 99=342, 99.9=713, 99.99=3239] 
2025-04-02 00:25:05:264 60 sec: 365333 operations; 5967.2 current ops/sec; est completion in 19 hours 34 minutes [READ: Count=29941, Max=8183, Min=79, Avg=166.23, 90=236, 99=468, 99.9=1224, 99.99=3965] [UPDATE: Count=29731, Max=9375, Min=77, Avg=164.8, 90=232, 99=473, 99.9=1350, 99.99=4283] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2025-04-02 00:25:06:272 61 sec: 372017 operations; 6630.95 current ops/sec; est completion in 19 hours 32 minutes [READ: Count=3357, Max=3839, Min=79, Avg=147.66, 90=210, 99=358, 99.9=1055, 99.99=3839] [CLEANUP: Count=1, Max=1438, Min=1438, Avg=1438, 90=1438, 99=1438, 99.9=1438, 99.99=1438] [UPDATE: Count=3327, Max=4587, Min=77, Avg=148.28, 90=212, 99=429, 99.9=945, 99.99=4587] 
[OVERALL], RunTime(ms), 61015
[OVERALL], Throughput(ops/sec), 6097.140047529296
[TOTAL_GCS_Copy], Count, 34
[TOTAL_GC_TIME_Copy], Time(ms), 24
[TOTAL_GC_TIME_%_Copy], Time(%), 0.0393345898549537
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 34
[TOTAL_GC_TIME], Time(ms), 24
[TOTAL_GC_TIME_%], Time(%), 0.0393345898549537
[READ], Operations, 186179
[READ], AverageLatency(us), 161.93140472341133
[READ], MinLatency(us), 73
[READ], MaxLatency(us), 53311
[READ], 95thPercentileLatency(us), 258
[READ], 99thPercentileLatency(us), 437
[READ], Return=OK, 186179
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1438.0
[CLEANUP], MinLatency(us), 1438
[CLEANUP], MaxLatency(us), 1438
[CLEANUP], 95thPercentileLatency(us), 1438
[CLEANUP], 99thPercentileLatency(us), 1438
[UPDATE], Operations, 185838
[UPDATE], AverageLatency(us), 160.071373992402
[UPDATE], MinLatency(us), 74
[UPDATE], MaxLatency(us), 20703
[UPDATE], 95thPercentileLatency(us), 256
[UPDATE], 99thPercentileLatency(us), 431
[UPDATE], Return=OK, 185838
AUTOTEST_DONE